my_string = input("Напишите любое предложение: ")                       # Вводим с клавиатуры любое предложение
print("Количество символов в вашем предложении =", len(my_string))      # Вычисляем количество символов в предложении
print(my_string.upper())                                                # Выводим предложение в верхний регистр
print(my_string.lower())                                                # Выводим предложение в нижний регистр
print(my_string.replace(' ', ''))                           # Заменяем пробелы в предложении на их отсутствие
print(my_string[0])                                                     # Выводим первый символ в предложении
print(my_string[-1])                                                    # Выводим крайний символ в предложении
